espressif/esp-idf/components/soc/esp32h4/register/hw_ver_beta5/soc/interrupt_matrix_reg.h
/** INTERRUPT_CORE0_ZB_MAC_INTR_MAP_REG register
 *  ZB_MAC_INTR mapping register
 */
#define INTERRUPT_CORE0_ZB_MAC_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x30)
/** INTERRUPT_CORE0_ZB_MAC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_ZB_MAC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_ZB_MAC_INTR_MAP_M  (INTERRUPT_CORE0_ZB_MAC_INTR_MAP_V << INTERRUPT_CORE0_ZB_MAC_INTR_MAP_S)
#define INTERRUPT_CORE0_ZB_MAC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_ZB_MAC_INTR_MAP_S  0
/** INTERRUPT_CORE0_ZB_MAC_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_ZB_MAC_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_ZB_MAC_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_ZB_MAC_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_ZB_MAC_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_ZB_MAC_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_ZB_MAC_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_MODEM_APB_TIMEOUT_INTR_MAP_REG register
 *  MODEM_APB_TIMEOUT_INTR mapping register
 */
#define INTERRUPT_CORE0_MODEM_APB_TIMEOUT_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x34)
/** INTERRUPT_CORE0_MODEM_APB_TIMEOUT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MODEM_APB_TIMEOUT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MODEM_APB_TIMEOUT_INTR_MAP_M  (INTERRUPT_CORE0_MODEM_APB_TIMEOUT_INTR_MAP_V << INTERRUPT_CORE0_MODEM_APB_TIMEOUT_INTR_MAP_S)
#define INTERRUPT_CORE0_MODEM_APB_TIMEOUT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MODEM_APB_TIMEOUT_INTR_MAP_S  0
/** INTERRUPT_CORE0_MODEM_APB_TIMEOUT_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_MODEM_APB_TIMEOUT_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_MODEM_APB_TIMEOUT_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_MODEM_APB_TIMEOUT_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_MODEM_APB_TIMEOUT_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_MODEM_APB_TIMEOUT_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_MODEM_APB_TIMEOUT_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_BT_MAC_INT1_MAP_REG register
 *  BT_MAC_INT1 mapping register
 */
#define INTERRUPT_CORE0_BT_MAC_INT1_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x38)
/** INTERRUPT_CORE0_BT_MAC_INT1_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_BT_MAC_INT1_MAP    0x0000003FU
#define INTERRUPT_CORE0_BT_MAC_INT1_MAP_M  (INTERRUPT_CORE0_BT_MAC_INT1_MAP_V << INTERRUPT_CORE0_BT_MAC_INT1_MAP_S)
#define INTERRUPT_CORE0_BT_MAC_INT1_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_BT_MAC_INT1_MAP_S  0
/** INTERRUPT_CORE0_BT_MAC_INT1_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_BT_MAC_INT1_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_BT_MAC_INT1_PASS_IN_SEC_M  (INTERRUPT_CORE0_BT_MAC_INT1_PASS_IN_SEC_V << INTERRUPT_CORE0_BT_MAC_INT1_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_BT_MAC_INT1_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_BT_MAC_INT1_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_PMU_INTR_MAP_REG register
 *  PMU_INTR mapping register
 */
#define INTERRUPT_CORE0_PMU_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x3c)
/** INTERRUPT_CORE0_PMU_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_PMU_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_PMU_INTR_MAP_M  (INTERRUPT_CORE0_PMU_INTR_MAP_V << INTERRUPT_CORE0_PMU_INTR_MAP_S)
#define INTERRUPT_CORE0_PMU_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PMU_INTR_MAP_S  0
/** INTERRUPT_CORE0_PMU_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_PMU_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_PMU_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_PMU_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_PMU_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_PMU_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_PMU_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_EFUSE_INTR_MAP_REG register
 *  EFUSE_INTR mapping register
 */
#define INTERRUPT_CORE0_EFUSE_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x40)
/** INTERRUPT_CORE0_EFUSE_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_EFUSE_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_EFUSE_INTR_MAP_M  (INTERRUPT_CORE0_EFUSE_INTR_MAP_V << INTERRUPT_CORE0_EFUSE_INTR_MAP_S)
#define INTERRUPT_CORE0_EFUSE_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_EFUSE_INTR_MAP_S  0
/** INTERRUPT_CORE0_EFUSE_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_EFUSE_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_EFUSE_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_EFUSE_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_EFUSE_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_EFUSE_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_EFUSE_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP_REG register
 *  LP_RTC_TIMER_INTR mapping register
 */
#define INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x44)
/** INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP_M  (INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP_V << INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP_S)
#define INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP_S  0
/** INTERRUPT_CORE0_LP_RTC_TIMER_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_LP_RTC_TIMER_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_LP_RTC_TIMER_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_LP_RTC_TIMER_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_LP_RTC_TIMER_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_LP_RTC_TIMER_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_LP_RTC_TIMER_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_LP_RTC_BLE_TIMER_INTR_MAP_REG register
 *  LP_RTC_BLE_TIMER_INTR mapping register
 */
#define INTERRUPT_CORE0_LP_RTC_BLE_TIMER_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x48)
/** INTERRUPT_CORE0_LP_RTC_BLE_TIMER_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_LP_RTC_BLE_TIMER_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_RTC_BLE_TIMER_INTR_MAP_M  (INTERRUPT_CORE0_LP_RTC_BLE_TIMER_INTR_MAP_V << INTERRUPT_CORE0_LP_RTC_BLE_TIMER_INTR_MAP_S)
#define INTERRUPT_CORE0_LP_RTC_BLE_TIMER_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_RTC_BLE_TIMER_INTR_MAP_S  0
/** INTERRUPT_CORE0_LP_RTC_BLE_TIMER_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_LP_RTC_BLE_TIMER_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_LP_RTC_BLE_TIMER_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_LP_RTC_BLE_TIMER_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_LP_RTC_BLE_TIMER_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_LP_RTC_BLE_TIMER_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_LP_RTC_BLE_TIMER_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_LP_WDT_INTR_MAP_REG register
 *  LP_WDT_INTR mapping register
 */
#define INTERRUPT_CORE0_LP_WDT_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x4c)
/** INTERRUPT_CORE0_LP_WDT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_LP_WDT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_WDT_INTR_MAP_M  (INTERRUPT_CORE0_LP_WDT_INTR_MAP_V << INTERRUPT_CORE0_LP_WDT_INTR_MAP_S)
#define INTERRUPT_CORE0_LP_WDT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_WDT_INTR_MAP_S  0
/** INTERRUPT_CORE0_LP_WDT_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_LP_WDT_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_LP_WDT_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_LP_WDT_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_LP_WDT_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_LP_WDT_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_LP_WDT_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_TOUCH_INTR_MAP_REG register
 *  TOUCH_INTR mapping register
 */
#define INTERRUPT_CORE0_TOUCH_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x50)
/** INTERRUPT_CORE0_TOUCH_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_TOUCH_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_TOUCH_INTR_MAP_M  (INTERRUPT_CORE0_TOUCH_INTR_MAP_V << INTERRUPT_CORE0_TOUCH_INTR_MAP_S)
#define INTERRUPT_CORE0_TOUCH_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TOUCH_INTR_MAP_S  0
/** INTERRUPT_CORE0_TOUCH_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_TOUCH_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_TOUCH_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_TOUCH_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_TOUCH_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_TOUCH_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_TOUCH_INTR_PASS_IN_SEC_S  8

