espressif/esp-idf/components/soc/esp32h4/register/hw_ver_beta5/soc/interrupt_matrix_reg.h
/** INTERRUPT_CORE0_CPU_APM_M2_INTR_MAP_REG register
 *  CPU_APM_M2_INTR mapping register
 */
#define INTERRUPT_CORE0_CPU_APM_M2_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0xa8)
/** INTERRUPT_CORE0_CPU_APM_M2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_CPU_APM_M2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_CPU_APM_M2_INTR_MAP_M  (INTERRUPT_CORE0_CPU_APM_M2_INTR_MAP_V << INTERRUPT_CORE0_CPU_APM_M2_INTR_MAP_S)
#define INTERRUPT_CORE0_CPU_APM_M2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CPU_APM_M2_INTR_MAP_S  0
/** INTERRUPT_CORE0_CPU_APM_M2_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_CPU_APM_M2_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_CPU_APM_M2_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_CPU_APM_M2_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_CPU_APM_M2_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_CPU_APM_M2_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_CPU_APM_M2_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_CPU_APM_M3_INTR_MAP_REG register
 *  CPU_APM_M3_INTR mapping register
 */
#define INTERRUPT_CORE0_CPU_APM_M3_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0xac)
/** INTERRUPT_CORE0_CPU_APM_M3_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_CPU_APM_M3_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_CPU_APM_M3_INTR_MAP_M  (INTERRUPT_CORE0_CPU_APM_M3_INTR_MAP_V << INTERRUPT_CORE0_CPU_APM_M3_INTR_MAP_S)
#define INTERRUPT_CORE0_CPU_APM_M3_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CPU_APM_M3_INTR_MAP_S  0
/** INTERRUPT_CORE0_CPU_APM_M3_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_CPU_APM_M3_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_CPU_APM_M3_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_CPU_APM_M3_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_CPU_APM_M3_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_CPU_APM_M3_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_CPU_APM_M3_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_MSPI_INTR_MAP_REG register
 *  MSPI_INTR mapping register
 */
#define INTERRUPT_CORE0_MSPI_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0xb0)
/** INTERRUPT_CORE0_MSPI_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MSPI_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MSPI_INTR_MAP_M  (INTERRUPT_CORE0_MSPI_INTR_MAP_V << INTERRUPT_CORE0_MSPI_INTR_MAP_S)
#define INTERRUPT_CORE0_MSPI_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MSPI_INTR_MAP_S  0
/** INTERRUPT_CORE0_MSPI_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_MSPI_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_MSPI_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_MSPI_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_MSPI_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_MSPI_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_MSPI_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_I2S_INTR_MAP_REG register
 *  I2S_INTR mapping register
 */
#define INTERRUPT_CORE0_I2S_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0xb4)
/** INTERRUPT_CORE0_I2S_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_I2S_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_I2S_INTR_MAP_M  (INTERRUPT_CORE0_I2S_INTR_MAP_V << INTERRUPT_CORE0_I2S_INTR_MAP_S)
#define INTERRUPT_CORE0_I2S_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_I2S_INTR_MAP_S  0
/** INTERRUPT_CORE0_I2S_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_I2S_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_I2S_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_I2S_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_I2S_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_I2S_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_I2S_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_UHCI0_INTR_MAP_REG register
 *  UHCI0_INTR mapping register
 */
#define INTERRUPT_CORE0_UHCI0_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0xb8)
/** INTERRUPT_CORE0_UHCI0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_UHCI0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_UHCI0_INTR_MAP_M  (INTERRUPT_CORE0_UHCI0_INTR_MAP_V << INTERRUPT_CORE0_UHCI0_INTR_MAP_S)
#define INTERRUPT_CORE0_UHCI0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_UHCI0_INTR_MAP_S  0
/** INTERRUPT_CORE0_UHCI0_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_UHCI0_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_UHCI0_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_UHCI0_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_UHCI0_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_UHCI0_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_UHCI0_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_UART0_INTR_MAP_REG register
 *  UART0_INTR mapping register
 */
#define INTERRUPT_CORE0_UART0_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0xbc)
/** INTERRUPT_CORE0_UART0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_UART0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_UART0_INTR_MAP_M  (INTERRUPT_CORE0_UART0_INTR_MAP_V << INTERRUPT_CORE0_UART0_INTR_MAP_S)
#define INTERRUPT_CORE0_UART0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_UART0_INTR_MAP_S  0
/** INTERRUPT_CORE0_UART0_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_UART0_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_UART0_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_UART0_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_UART0_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_UART0_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_UART0_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_UART1_INTR_MAP_REG register
 *  UART1_INTR mapping register
 */
#define INTERRUPT_CORE0_UART1_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0xc0)
/** INTERRUPT_CORE0_UART1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_UART1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_UART1_INTR_MAP_M  (INTERRUPT_CORE0_UART1_INTR_MAP_V << INTERRUPT_CORE0_UART1_INTR_MAP_S)
#define INTERRUPT_CORE0_UART1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_UART1_INTR_MAP_S  0
/** INTERRUPT_CORE0_UART1_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_UART1_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_UART1_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_UART1_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_UART1_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_UART1_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_UART1_INTR_PASS_IN_SEC_S  8

