espressif/esp-idf/components/soc/esp32h4/register/hw_ver_beta5/soc/interrupt_matrix_reg.h
/** INTERRUPT_CORE0_ASRC_CHNL1_INTR_MAP_REG register
 *  ASRC_CHNL1_INTR mapping register
 */
#define INTERRUPT_CORE0_ASRC_CHNL1_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x11c)
/** INTERRUPT_CORE0_ASRC_CHNL1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_ASRC_CHNL1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_ASRC_CHNL1_INTR_MAP_M  (INTERRUPT_CORE0_ASRC_CHNL1_INTR_MAP_V << INTERRUPT_CORE0_ASRC_CHNL1_INTR_MAP_S)
#define INTERRUPT_CORE0_ASRC_CHNL1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_ASRC_CHNL1_INTR_MAP_S  0
/** INTERRUPT_CORE0_ASRC_CHNL1_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_ASRC_CHNL1_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_ASRC_CHNL1_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_ASRC_CHNL1_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_ASRC_CHNL1_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_ASRC_CHNL1_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_ASRC_CHNL1_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_ZERO_DET_INTR_MAP_REG register
 *  ZERO_DET_INTR mapping register
 */
#define INTERRUPT_CORE0_ZERO_DET_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x120)
/** INTERRUPT_CORE0_ZERO_DET_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_ZERO_DET_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_ZERO_DET_INTR_MAP_M  (INTERRUPT_CORE0_ZERO_DET_INTR_MAP_V << INTERRUPT_CORE0_ZERO_DET_INTR_MAP_S)
#define INTERRUPT_CORE0_ZERO_DET_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_ZERO_DET_INTR_MAP_S  0
/** INTERRUPT_CORE0_ZERO_DET_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_ZERO_DET_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_ZERO_DET_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_ZERO_DET_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_ZERO_DET_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_ZERO_DET_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_ZERO_DET_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_REG register
 *  DMA_IN_CH0_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x124)
/** INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_M  (INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_V << INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_S  0
/** INTERRUPT_CORE0_DMA_IN_CH0_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_DMA_IN_CH0_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_DMA_IN_CH0_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_REG register
 *  DMA_IN_CH1_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x128)
/** INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_M  (INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_V << INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_S  0
/** INTERRUPT_CORE0_DMA_IN_CH1_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_DMA_IN_CH1_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_DMA_IN_CH1_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP_REG register
 *  DMA_IN_CH2_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x12c)
/** INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP_M  (INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP_V << INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP_S  0
/** INTERRUPT_CORE0_DMA_IN_CH2_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_DMA_IN_CH2_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_DMA_IN_CH2_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_DMA_IN_CH2_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_DMA_IN_CH2_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_DMA_IN_CH2_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_DMA_IN_CH2_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_DMA_IN_CH3_INTR_MAP_REG register
 *  DMA_IN_CH3_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_IN_CH3_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x130)
/** INTERRUPT_CORE0_DMA_IN_CH3_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_IN_CH3_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH3_INTR_MAP_M  (INTERRUPT_CORE0_DMA_IN_CH3_INTR_MAP_V << INTERRUPT_CORE0_DMA_IN_CH3_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_IN_CH3_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH3_INTR_MAP_S  0
/** INTERRUPT_CORE0_DMA_IN_CH3_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_DMA_IN_CH3_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_DMA_IN_CH3_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_DMA_IN_CH3_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_DMA_IN_CH3_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_DMA_IN_CH3_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_DMA_IN_CH3_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_DMA_IN_CH4_INTR_MAP_REG register
 *  DMA_IN_CH4_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_IN_CH4_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x134)
/** INTERRUPT_CORE0_DMA_IN_CH4_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_IN_CH4_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH4_INTR_MAP_M  (INTERRUPT_CORE0_DMA_IN_CH4_INTR_MAP_V << INTERRUPT_CORE0_DMA_IN_CH4_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_IN_CH4_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH4_INTR_MAP_S  0
/** INTERRUPT_CORE0_DMA_IN_CH4_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_DMA_IN_CH4_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_DMA_IN_CH4_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_DMA_IN_CH4_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_DMA_IN_CH4_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_DMA_IN_CH4_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_DMA_IN_CH4_INTR_PASS_IN_SEC_S  8

