espressif/esp-idf/components/soc/esp32h4/register/hw_ver_beta5/soc/interrupt_matrix_reg.h
/** INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP_REG register
 *  DMA_OUT_CH0_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x138)
/** INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP_M  (INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP_V << INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP_S  0
/** INTERRUPT_CORE0_DMA_OUT_CH0_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_DMA_OUT_CH0_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_DMA_OUT_CH0_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_DMA_OUT_CH0_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_DMA_OUT_CH0_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_DMA_OUT_CH0_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_DMA_OUT_CH0_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP_REG register
 *  DMA_OUT_CH1_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x13c)
/** INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP_M  (INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP_V << INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP_S  0
/** INTERRUPT_CORE0_DMA_OUT_CH1_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_DMA_OUT_CH1_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_DMA_OUT_CH1_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_DMA_OUT_CH1_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_DMA_OUT_CH1_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_DMA_OUT_CH1_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_DMA_OUT_CH1_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP_REG register
 *  DMA_OUT_CH2_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x140)
/** INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP_M  (INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP_V << INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP_S  0
/** INTERRUPT_CORE0_DMA_OUT_CH2_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_DMA_OUT_CH2_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_DMA_OUT_CH2_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_DMA_OUT_CH2_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_DMA_OUT_CH2_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_DMA_OUT_CH2_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_DMA_OUT_CH2_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_DMA_OUT_CH3_INTR_MAP_REG register
 *  DMA_OUT_CH3_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_OUT_CH3_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x144)
/** INTERRUPT_CORE0_DMA_OUT_CH3_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_OUT_CH3_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_OUT_CH3_INTR_MAP_M  (INTERRUPT_CORE0_DMA_OUT_CH3_INTR_MAP_V << INTERRUPT_CORE0_DMA_OUT_CH3_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_OUT_CH3_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_OUT_CH3_INTR_MAP_S  0
/** INTERRUPT_CORE0_DMA_OUT_CH3_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_DMA_OUT_CH3_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_DMA_OUT_CH3_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_DMA_OUT_CH3_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_DMA_OUT_CH3_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_DMA_OUT_CH3_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_DMA_OUT_CH3_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_DMA_OUT_CH4_INTR_MAP_REG register
 *  DMA_OUT_CH4_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_OUT_CH4_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x148)
/** INTERRUPT_CORE0_DMA_OUT_CH4_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_OUT_CH4_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_OUT_CH4_INTR_MAP_M  (INTERRUPT_CORE0_DMA_OUT_CH4_INTR_MAP_V << INTERRUPT_CORE0_DMA_OUT_CH4_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_OUT_CH4_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_OUT_CH4_INTR_MAP_S  0
/** INTERRUPT_CORE0_DMA_OUT_CH4_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_DMA_OUT_CH4_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_DMA_OUT_CH4_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_DMA_OUT_CH4_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_DMA_OUT_CH4_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_DMA_OUT_CH4_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_DMA_OUT_CH4_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_GPSPI2_INTR_MAP_REG register
 *  GPSPI2_INTR mapping register
 */
#define INTERRUPT_CORE0_GPSPI2_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x14c)
/** INTERRUPT_CORE0_GPSPI2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_GPSPI2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_GPSPI2_INTR_MAP_M  (INTERRUPT_CORE0_GPSPI2_INTR_MAP_V << INTERRUPT_CORE0_GPSPI2_INTR_MAP_S)
#define INTERRUPT_CORE0_GPSPI2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_GPSPI2_INTR_MAP_S  0
/** INTERRUPT_CORE0_GPSPI2_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_GPSPI2_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_GPSPI2_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_GPSPI2_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_GPSPI2_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_GPSPI2_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_GPSPI2_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_GPSPI3_INTR_MAP_REG register
 *  GPSPI3_INTR mapping register
 */
#define INTERRUPT_CORE0_GPSPI3_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x150)
/** INTERRUPT_CORE0_GPSPI3_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_GPSPI3_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_GPSPI3_INTR_MAP_M  (INTERRUPT_CORE0_GPSPI3_INTR_MAP_V << INTERRUPT_CORE0_GPSPI3_INTR_MAP_S)
#define INTERRUPT_CORE0_GPSPI3_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_GPSPI3_INTR_MAP_S  0
/** INTERRUPT_CORE0_GPSPI3_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_GPSPI3_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_GPSPI3_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_GPSPI3_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_GPSPI3_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_GPSPI3_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_GPSPI3_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_AES_INTR_MAP_REG register
 *  AES_INTR mapping register
 */
#define INTERRUPT_CORE0_AES_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x154)
/** INTERRUPT_CORE0_AES_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_AES_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_AES_INTR_MAP_M  (INTERRUPT_CORE0_AES_INTR_MAP_V << INTERRUPT_CORE0_AES_INTR_MAP_S)
#define INTERRUPT_CORE0_AES_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AES_INTR_MAP_S  0
/** INTERRUPT_CORE0_AES_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_AES_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_AES_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_AES_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_AES_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_AES_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_AES_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_SHA_INTR_MAP_REG register
 *  SHA_INTR mapping register
 */
#define INTERRUPT_CORE0_SHA_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x158)
/** INTERRUPT_CORE0_SHA_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_SHA_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_SHA_INTR_MAP_M  (INTERRUPT_CORE0_SHA_INTR_MAP_V << INTERRUPT_CORE0_SHA_INTR_MAP_S)
#define INTERRUPT_CORE0_SHA_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SHA_INTR_MAP_S  0
/** INTERRUPT_CORE0_SHA_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_SHA_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_SHA_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_SHA_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_SHA_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_SHA_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_SHA_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_ECC_INTR_MAP_REG register
 *  ECC_INTR mapping register
 */
#define INTERRUPT_CORE0_ECC_INTR_MAP_REG(i) (DR_REG_INTERRUPT_BASE(i) + 0x15c)
/** INTERRUPT_CORE0_ECC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_ECC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_ECC_INTR_MAP_M  (INTERRUPT_CORE0_ECC_INTR_MAP_V << INTERRUPT_CORE0_ECC_INTR_MAP_S)
#define INTERRUPT_CORE0_ECC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_ECC_INTR_MAP_S  0
/** INTERRUPT_CORE0_ECC_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_ECC_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_ECC_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_ECC_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_ECC_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_ECC_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_ECC_INTR_PASS_IN_SEC_S  8

